* ob-extempore

org-babel functions for extempore evaluation

** examples

#+BEGIN_SRC extempore
(now)
#+END_SRC

#+RESULTS:
: 154447360

#+BEGIN_SRC extempore
(bind-func xtlang_closure
  (lambda (c:double d:i64)
    (* c (i64tod d))))
(xtlang_closure 4.5 2)
#+END_SRC

#+RESULTS:
: 9.000000
